fix: update diagrams to mermaid
Signed-off-by: Michael Kantor <6068672+kantorcodes@users.noreply.github.com>
